; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	spectrograph1 - mode
	spectrograph2 - mode
	image0 - mode
	Star3 - direction
	Star2 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star4 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Star18 - direction
	Phenomenon19 - direction
	Star20 - direction
	Star21 - direction
	Star22 - direction
	Planet23 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star3)
	(supports instrument2 spectrograph2)
	(supports instrument2 image0)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet17)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(supports instrument4 spectrograph2)
	(supports instrument4 spectrograph1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star3)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon16)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 image0)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 image0)
	(supports instrument7 spectrograph2)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet17)
	(supports instrument8 spectrograph2)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet23)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 Star12)
	(have_image Star4 spectrograph1)
	(have_image Star6 spectrograph1)
	(have_image Planet7 spectrograph1)
	(have_image Planet8 spectrograph1)
	(have_image Star10 spectrograph1)
	(have_image Phenomenon11 spectrograph2)
	(have_image Star12 spectrograph1)
	(have_image Star14 image0)
	(have_image Planet15 spectrograph1)
	(have_image Phenomenon16 spectrograph1)
	(have_image Planet17 spectrograph1)
	(have_image Star18 spectrograph1)
	(have_image Phenomenon19 spectrograph2)
	(have_image Star20 image0)
	(have_image Star22 spectrograph1)
	(have_image Planet23 image0)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 18
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 18
3. (turn_to satellite4 groundstation0 planet23)
   deleted: (pointing satellite4 planet23)
   added: (pointing satellite4 groundstation0)
   goals met: 0 of 18
4. (calibrate satellite4 instrument8 groundstation0)
   added: (calibrated instrument8)
   goals met: 0 of 18
5. (turn_to satellite4 phenomenon11 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon11)
   goals met: 0 of 18
6. (take_image satellite4 phenomenon11 instrument8 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 1 of 18
7. (turn_to satellite4 phenomenon19 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon19)
   goals met: 1 of 18
8. (take_image satellite4 phenomenon19 instrument8 spectrograph2)
   added: (have_image phenomenon19 spectrograph2)
   goals met: 2 of 18
9. (turn_to satellite4 planet23 phenomenon19)
   deleted: (pointing satellite4 phenomenon19)
   added: (pointing satellite4 planet23)
   goals met: 2 of 18
10. (take_image satellite4 planet23 instrument8 image0)
   added: (have_image planet23 image0)
   goals met: 3 of 18
11. (turn_to satellite4 star14 planet23)
   deleted: (pointing satellite4 planet23)
   added: (pointing satellite4 star14)
   goals met: 3 of 18
12. (take_image satellite4 star14 instrument8 image0)
   added: (have_image star14 image0)
   goals met: 4 of 18
13. (turn_to satellite4 star20 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 star20)
   goals met: 4 of 18
14. (take_image satellite4 star20 instrument8 image0)
   added: (have_image star20 image0)
   goals met: 5 of 18
15. (turn_to satellite2 star3 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 star3)
   goals met: 5 of 18
16. (calibrate satellite2 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 5 of 18
17. (turn_to satellite2 phenomenon16 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon16)
   goals met: 5 of 18
18. (take_image satellite2 phenomenon16 instrument4 spectrograph1)
   added: (have_image phenomenon16 spectrograph1)
   goals met: 6 of 18
19. (turn_to satellite2 planet15 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 planet15)
   goals met: 6 of 18
20. (take_image satellite2 planet15 instrument4 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 7 of 18
21. (turn_to satellite2 planet17 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet17)
   goals met: 7 of 18
22. (take_image satellite2 planet17 instrument4 spectrograph1)
   added: (have_image planet17 spectrograph1)
   goals met: 8 of 18
23. (turn_to satellite2 planet7 planet17)
   deleted: (pointing satellite2 planet17)
   added: (pointing satellite2 planet7)
   goals met: 8 of 18
24. (take_image satellite2 planet7 instrument4 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 9 of 18
25. (turn_to satellite2 planet8 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 planet8)
   goals met: 9 of 18
26. (take_image satellite2 planet8 instrument4 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 10 of 18
27. (turn_to satellite2 star10 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star10)
   goals met: 10 of 18
28. (take_image satellite2 star10 instrument4 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 11 of 18
29. (turn_to satellite2 star12 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star12)
   goals met: 11 of 18
30. (take_image satellite2 star12 instrument4 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 12 of 18
31. (turn_to satellite2 star18 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star18)
   goals met: 12 of 18
32. (take_image satellite2 star18 instrument4 spectrograph1)
   added: (have_image star18 spectrograph1)
   goals met: 13 of 18
33. (turn_to satellite2 star22 star18)
   deleted: (pointing satellite2 star18)
   added: (pointing satellite2 star22)
   goals met: 13 of 18
34. (take_image satellite2 star22 instrument4 spectrograph1)
   added: (have_image star22 spectrograph1)
   goals met: 14 of 18
35. (turn_to satellite2 star4 star22)
   deleted: (pointing satellite2 star22)
   added: (pointing satellite2 star4)
   goals met: 14 of 18
36. (take_image satellite2 star4 instrument4 spectrograph1)
   added: (have_image star4 spectrograph1)
   goals met: 15 of 18
37. (turn_to satellite2 star6 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star6)
   goals met: 15 of 18
38. (take_image satellite2 star6 instrument4 spectrograph1)
   added: (have_image star6 spectrograph1)
   goals met: 16 of 18
39. (turn_to satellite1 star12 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star12)
   goals met: 17 of 18
40. (turn_to satellite0 groundstation0 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 groundstation0)
   goals met: 18 of 18
